import React from 'react';
import '../style.css';

export default function Terms() {
    return(
        <div>
            <dl>
                <dt><b>Семантичний аналіз</b></dt>
                <dd>cемантичний аналіз тексту оцінює кількість слів чи фраз, які визначають сенс тексту, тобто його семантичне ядро, та статистичні показники. Правильно сформоване семантичне ядро здатне швидко просувати статтю у пошуковій системі.</dd>
                <dt><b>SEO</b></dt>
                <dd>SEO (англ. Search Engine Optimization) – это комплекс мер по улучшению сайта для его ранжирования в поисковых системах.</dd>
                <dt><b>Семантичне ядро тексту</b></dt>
                <dd>таблиця, що показує частоту використання всіх слів у тексті.</dd>
                <dt><b>Стоп-слова</b></dt>
                <dd>слова без самостійного значення (наприклад, прийменники).</dd>
                <dt><b>Лематизація</b></dt>
                <dd>один з методів морфологічного аналізу, метою якого є приведення словоформи до її основної словникової форми (леми).</dd>
                <dt><b>Водність тексту</b></dt>
                <dd>відсоток змісту в тексті нічого не значущих слів, що не несуть корисної інформації (стоп-слів). Максимально допустимим показником водності вважатимуться 60%.</dd>
                <dt><b>Нудота</b></dt>
                <dd>частота вживання слів у тексті, відсоток чи кількість повторів. Зазвичай її використовують як показник того, наскільки текст насичений ключовими словами і легко читається.</dd>
                <dt><b>Класична нудота</b></dt>
                <dd>квадратний корінь із числа повторень найчастішого слова. Максимально допустиме значення класичної нудоти залежить від обсягу тексту - для 20 000 знаків нудота, що дорівнює 5, буде нормальною, а для 1000 знаків - надто високою.</dd>
                <dt><b>Академічна нудота</b></dt>
                <dd>співвідношення ключових слів до загальної кількості слів, причому враховуються різні морфологічні норми ключа. Наприклад «нудота, нудоти, нудоту» буде вважатися тим самим ключем. Показник у 5–15% вважається нормальним для академічної нудоти.</dd>
                
            </dl>
        </div>
    );
}